<template>
  <div class="city">
    <h2>{{currentCity.name}}</h2>
    <p>{{currentCity.content}}</p>
  </div>
</template>

<script>
  export default {
    // 通过props接收params路由参数
    props:['id'],
    data() {
      return {
        // 城市数组
        citys:[
          {
            id:1,
            name:'北京市',
            content:'北京市（英语：Beijing Municipality [252]或Beijing City [131]），简称“京”，古称燕京、北平，是中华人民共和国首都、直辖市、国家中心城市、超大城市 [178]；中共中央、国务院批复确定的中国政治中心、文化中心、国际交往中心、科技创新中心 [1]；中国历史文化名城和古都之一、世界一线城市 [3] [138] [181]，总面积16410.54平方千米。截至2023年10月，北京市辖16个区 [80] [186] [188]。截至2024年末，北京市常住人口2183.2万人 [239]。'
          },
          {
            id:2,
            name:'上海市',
            content:'上海市（Shanghai City [232]），简称“沪”，别名“申”，是中华人民共和国直辖市 [35]，超大城市， [235]世界一线城市 [236]，位于中国东部，地处长江入海口 [157]，北界长江，东濒东海，南临杭州湾，西接江苏省和浙江省，总面积6340.5平方千米。 [35]截至2024年12月，上海市下辖16个区 [34]，常住人口2480.26万人 [234]；市人民政府驻地黄浦区人民大道200号。'
          },
          {
            id:3,
            name:'重庆市',
            content:'重庆市，简称“渝”，别称山城、江城， [288]地处中国西南地区、长江上游，是中华人民共和国直辖市、超大城市，国家中心城市， [1] [211]地貌以山地、丘陵为主。 [239]属亚热带季风性湿润气候， [239]长江干流在境内流程665千米。 [240]全市总面积8.24万平方千米， [27]重庆辖25个市辖区、8个县、4个自治县， [150] [327]2024年末，重庆常住人口3190.47万。'
          },
          {
            id:4,
            name:'天津市',
            content:'天津市（英文名：Tianjin City），简称“津”，别称津沽、津门，是中华人民共和国直辖市、国家中心城市、超大城市 [222]，地处中华人民共和国华北地区，海河流域下游，华北平原东北部，东临渤海，北依燕山，西靠首都北京市，其余均与河北省相邻，属暖温带半湿润季风性气候，四季分明。截至2023年10月，天津市下辖16个区 [93]，总面积11966.45平方千米。截至2024年末，天津市常住人口1364万人 [265]。'
          }
        ]
      }
    },
    mounted() {
      // $route是当前路由对象，它的params属性中保存的就是params路由参数
      console.log(this.$route.params);
      // this可以直接访问props成员
      console.log(this.id);
    },
    computed:{
      currentCity(){
        // 根据路由参数，从城市数组中找到对应的城市
        // return this.citys.find(c=>c.id==this.$route.params.id)
        return this.citys.find(c=>c.id==this.id)
      }
    }
  }
</script>

<style>
  .city{
    border: 1px solid lightgreen;
    padding: 10px;
  }
</style>